{"class_name": "Sequential", "keras_version": "2.0.2", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 2, 11], "trainable": true, "dtype": "float32", "name": "masking_1", "mask_value": -1}}, {"class_name": "LSTM", "config": {"batch_input_shape": [null, 2, 11], "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "return_sequences": false, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "unroll": false, "stateful": false, "unit_forget_bias": true, "kernel_constraint": null, "recurrent_constraint": null, "recurrent_dropout": 0.0, "go_backwards": false, "activity_regularizer": null, "trainable": true, "dtype": "float32", "name": "lstm_1", "implementation": 0, "activation": "tanh", "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "units": 32, "dropout": 0.2, "kernel_regularizer": null, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"batch_input_shape": [null, 32], "trainable": true, "dtype": "float32", "name": "dense_1", "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "activity_regularizer": null, "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "units": 6, "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "softmax"}}], "backend": "tensorflow"}