{"config": [{"config": {"dtype": "float32", "mask_value": -1, "batch_input_shape": [null, 3, 11], "trainable": true, "name": "masking_1"}, "class_name": "Masking"}, {"config": {"activation": "tanh", "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "stateful": false, "dropout": 0.2, "batch_input_shape": [null, 3, 11], "trainable": true, "dtype": "float32", "recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "go_backwards": false, "bias_constraint": null, "name": "lstm_1", "recurrent_activation": "hard_sigmoid", "return_sequences": false, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "recurrent_constraint": null, "implementation": 0, "recurrent_dropout": 0.0, "unroll": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 32, "unit_forget_bias": true, "recurrent_regularizer": null, "use_bias": true}, "class_name": "LSTM"}, {"config": {"kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "batch_input_shape": [null, 32], "bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "units": 6, "activation": "linear", "activity_regularizer": null, "trainable": true, "kernel_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "dtype": "float32", "use_bias": true}, "class_name": "Dense"}, {"config": {"activation": "softmax", "trainable": true, "name": "activation_1"}, "class_name": "Activation"}], "keras_version": "2.0.2", "class_name": "Sequential", "backend": "tensorflow"}